Repository: yo35/vcc
Catalog: po/*.po
Languages: fr

source: Unable to open the INI file %1 for reading
fr: Impossible d'ouvrir le fichier INI %1 en lecture

source: Unconsistency in the INI file %1 at line #%2
fr: Le fichier INI %1 est corrompu à la ligne #%2

source: Unable to open the INI file %1 for writing
fr: Impossible d'ouvrir le fichier INI %1 en écriture

source: The version (%1) of the keyboard map file %2 is not supported
fr: La version (%1) du fichier de plan de clavier %2 n'est pas supportée

source: The key %1 must be placed at least on one line on the keyboard
fr: La touche %1 doit être placée au moins sur une ligne sur le clavier

source: The key %1 must have at least one keyval
fr: La touche %1 doit avoir au moins une keyval

source: Time control
fr: Cadence

source: Simplest time control mode. No additional delay is never added to the player's main time.
fr: Mode de contrôle de temps le plus simple. Aucun délai supplémentaire n'est jamais ajouté au temps principal du joueur.

source: At each move, the player is granted an additional delay, so that his or her global clock time is always greater than this bonus time at the beginning of his or her playing turn. Additional delays can be accumulated.
fr: À chaque coup, le joueur bénéficie d'un bonus de temps, si bien que son temps total à la pendule est toujours supérieur à ce temps additionnel au début de son tour de jeu. Les temps additionnels peuvent être cumulés.

source: Same as Fischer time control mode, except that additional delays cannot be accumulated. Bronstein mode can also be thought as a kind of sudden death mode in which the clock waits for a certain delay before starting to substract from the player's remaining time when engaged.
fr: Même mode de contrôle de temps que le mode Fischer, à l'exception du fait que les temps additionnels ne peuvent pas être cumulés. Le mode Bronstein peut également être pensé comme une cadence mort subite où la pendule attendrait pendant un certain délai avant de commencer à décompter le temps du joueur au début de son tour de jeu.

source: While the current player is deciding on his or her move, the opponent's time is increasing. Therefore, the sum of both clocks remains always the same.
fr: Quand un joueur est au trait, le temps de son adversaire augmente. Ainsi, la somme des temps des deux horloges reste toujours constante.

source: When the player's main time expires, he or she is granted one or more additional time periods, denoted as "byo-yomi" periods. If the move is completed before the current byo-yomi expires, the clock is reset with the whole byo-yomi time available for the next move; otherwise, the next byo-yomi starts. At the end of the last byo-yomi, the game is lost.
fr: Quand un joueur arrive à l'issue de son temps de réflexion, il bénéficie d'une ou plusieurs périodes de temps supplémentaires, appelées périodes "byo-yomi". Si le joueur termine son coup avant la fin du byo-yomi courant, il bénéficie pour le coup suivant de la totalité du temps correspondant à ce byo-yomi ; dans le cas contraire, le byo-yomi suivant est entammé. À la fin du dernier byo-yomi, la partie est perdue.

source: Left
fr: Gauche

source: Right
fr: Droite

source: Main time
fr: Temps principal

source: Increment
fr: Incrément

source: Byo-yomi periods
fr: Périodes byo-yomi

source: Time control values are the same for both sides
fr: Même temps pour les deux côtés

source: Unable to open the data file %1 for reading
fr: Impossible d'ouvrir le fichier de données %1 en lecture

source: Unconsistency in the data file %1 at line #%2
fr: Le fichier de données %1 est corrompu à la ligne #%2

source: Unable to open the data file %1 for writing
fr: Impossible d'ouvrir le fichier de données %1 en écriture

source: hour
fr: heure

source: Sudden death
fr: Mort subite

source: left
fr: gauche

source: right
fr: droite

source: by move
fr: par coup

source: byo-yomi period
fr: période byo-yomi

source: byo-yomi periods
fr: périodes byo-yomi

source: The version (%1) of the area map file %2 is not supported
fr: La version (%1) du fichier de plan de régions %2 n'est pas supporté

source: The number of keys reported the file %1 is incorrect
fr: Le nombre de touches spécifié dans le fichier %1 est incorrect

source: Incorrect affectation code for the key %1 in the file %2
fr: Code d'affection incorrect pour la touche %1 dans le fichier %2

source: Unable to create the INI configuration file at %1
fr: Impossible de créer le fichier de configuration INI à l'emplacement %1

source: Unable to retrieve the name of keyboard %1
fr: Impossible de récupérer le nom du clavier %1

source: Unable to retrieve the name of the layout file for keyboard %1
fr: Impossible de récupérer le nom du fichier de plan d'agencement pour le clavier %1

source: Unable to retrieve the name of the default area file for keyboard %1
fr: Impossible de récupérer le nom du fichier de plan de zones par défaut pour le clavier %1

source: Null character
fr: Caractère nul

source: Space
fr: Espace

source: Caps lock
fr: Verr maj

source: Shift lock
fr: Verr maj

source: Esc
fr: Echap

source: Return
fr: Entrée

source: Backspace
fr: Retour

source: Tabs
fr: Tab

source: Del
fr: Suppr

source: Ins
fr: Inser

source: Page up
fr: Page haut

source: Page down
fr: Page bas

source: Home
fr: Début

source: End
fr: Fin

source: Print screen
fr: Impr écran

source: Scroll lock
fr: Arrêt défil

source: Shift
fr: Maj

source: Meta
fr: Méta

source: Num lock
fr: Verr num

source: Decimal mark
fr: Séparateur décimal

source: No break space
fr: Espace insécable

source: Hyphen
fr: Césure

source: A simple and free chess clock software
fr: Un logiciel de pendule d'échecs simple et gratuit

source: Flag down
fr: Tombé

source: Since:
fr: Depuis :

source: Byo-yomi period
fr: Période byo-yomi

source: Debug information
fr: Informations de débug

source: Current directory
fr: Répertoire courant

source: Top directory
fr: Répertoire de référence

source: User directory
fr: Répertoire utilisateur

source: Keyval (hex)
fr: Keyval (héxa)

source: Name
fr: Nom

source: Symbol
fr: Symbole

source: Group
fr: Groupe

source: Level
fr: Niveau

source: Keyboard information
fr: Informations clavier

source: Players' names
fr: Noms des joueurs

source: Switch players
fr: Inverser les joueurs

source: Display players' names
fr: Afficher les noms des joueurs

source: Left player
fr: Joueur de gauche

source: Right player
fr: Joueur de droite

source: Reset
fr: Réinitialisation

source: Reset the clock
fr: Initialiser la pendule

source: Pause the clock
fr: Mettre la pendule en pause

source: Change the current time control
fr: Modifier la cadence

source: Edit the names of the players
fr: Modifier les noms des joueurs

source: Set the configuration and the preferences
fr: Définir la configuration et les préférences

source: A short help text
fr: Un court texte d'aide

source: Information about credits and license
fr: Informations sur les crédits et la licence

source: Do you really want to start a new game?
fr: Voulez-vous vraiment commencer une nouvelle partie ?

source: Stop this game?
fr: Terminer cette partie ?

source: Help
fr: Aide

source: To start playing and then change the running side of the clock, just push some keys on the keyboard. The left player have to push some key on the left side of the keyboard, the right player on the right side. If it does not work, it might be due to a misdetection of your keyboard layout; you can check it and correct it through the "Preferences" dialog. If your actual keyboard layout is not available among those proposed by VCC, you should select "Default QWERTY" or one of the default layouts that suits good to your keyboard. Thus, only the A-Z keys will be used by VCC, but the software will be usable anyway.
fr: Pour commencer la partie et ensuite changer le côté actif de la pendule, appuyer sur les touches du clavier. Le joueur de gauche doit appuyer sur une des touches de la gauche du clavier, le joueur de droite une des touches de la droite du clavier. Si ça ne fonctionne pas, c'est probablement dû à une mauvaise détection de l'agencement de votre clavier ; vous pouvez vérifier et corriger celui-ci dans la boîte de dialogue "Préférences". Si votre plan d'agencement de clavier n'est pas disponible parmi ceux proposé par VCC, vous pouvez sélectionner "Default QWERTY" ou bien l'un des agencements par défaut qui convient selon votre clavier. De cette façon, seules les touches de A à Z seront utilisées par VCC, mais le logiciel sera tout de même utilisable.

source: Preferences
fr: Préférences

source: Reset through the toolbar
fr: Remise-à-zéro par la barre d'outils

source: Ask for confirmation before resetting
fr: Demander confirmation avant la remise-à-zéro

source: Always
fr: Toujours

source: Only if the clock is still running
fr: Seulement si l'horloge n'est pas arrêtée

source: Never
fr: Jamais

source: Reset through the keyboard
fr: Remise-à-zéro par le clavier

source: Keys to press to reset
fr: Touches sur lesquelles appuyer pour la remise-à-zéro

source: CTRL keys (left and right)
fr: Touches CTRL (gauche et droite)

source: MAJ keys (left and right)
fr: Touches MAJ (gauche et droite)

source: Delay (milliseconds)
fr: Délai (millisecondes)

source: Pause through the keyboard
fr: Mise en pause par le clavier

source: Allow the game to be paused through the keyboard
fr: Autoriser le jeu à être mis en pause à partir du clavier

source: Keys to press to pause
fr: Touches sur lesquelles appuyer pour la mise en pause

source: Only the space key
fr: Seulement la touche espace

source: CTRL keys (left and right) + space
fr: Touches CTRL (gauche et droite) + espace

source: MAJ keys (left and right) + space
fr: Touches MAJ (gauche et droite) + espace

source: Display the status bar at the bottom of the main window
fr: Afficher la barre d'état en bas de la fenêtre principale

source: Display an increasing time counter when the flag is down
fr: Afficher un compteur de temps croissant quand le drapeau est tombé

source: Display extra time information when playing in Bronstein mode
fr: Afficher les informations de durée additionnelles quand on utilise le mode Bronstein

source: Display extra time information when playing in byo-yomi mode
fr: Afficher les informations de durée additionnelles quand on utilise le mode byo-yomi

source: Select the keyboard layout you are using
fr: Sélectionnez l'agencement de clavier que vous utilisez

source: Use the mouse buttons to switch between players
fr: Utiliser les boutons de la souris pour alterner les joueurs

source: The left player must click on the left button, the right player on the right button
fr: Le joueur de gauche doit cliquer sur le bouton de gauche, le joueur de droite sur le bouton de droite

source: Display the numeric keypad
fr: Afficher le pavé numérique

source: Modify the active areas by clicking on the keyboard
fr: Modifiez les zones actives en cliquant sur le clavier

source: Modify the left player's area
fr: Modifier la zone du joueur de gauche

source: Modify the right player's area
fr: Modifier la zone du joueur de droite

source: Active areas that players can use to engage the clock when playing
fr: Zones actives que les joueurs peuvent utiliser pour appuyer sur la pendule pendant la partie

source: left player's area
fr: zone du joueur de gauche

source: right player's area
fr: zone du joueur de droite

source: Keyboard active areas
fr: Zones actives du clavier

source: Control options
fr: Options de contrôle

source: Display options
fr: Options d'affichage
